#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
//int main()//设计一个程序来判断当前机器的字节序
//{
//	//写一段代码，告诉当前机器字节序
	//int  a = 1;
	//char* p = (char*)&a;
	//if (*p == 1)
	//{
	//	printf("大端存储\n");
	//}
	//else
	//{
	//	printf("小端存储\n");
	//}
//	return 0;
//}
//int check_sys()
//{
//	int  a = 1;
//	char* p = (char*)&a;
//	if (*p == 1)
//		return 1;
//	else
//		return 0;
//}
//int main()
//{
//	//写一段代码，告诉当前机器字节序
//	//返回1，小端
//	//返回2，大端
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("大端存储\n");
//	}
//	else
//	{
//		printf("小端存储\n");
//	}
//}

//int main()
//{
//	char a = -1;
//	signed char b = -1;
//	unsigned char c = -1;
//	printf("a = %d,b=%d,c=%d",a,b,c);//a=-1;b=-1;c=255(整形提升)
//}

//1000 0000 0000 0000 0000 0000 1000 0000(-128)-原码
//1000 1111 1111 1111 1111 1111 0111 1111-反码
//1000 1111 1111 1111 1111 1111 1000 0000-补码
//整形提升后： 
//1111 1111 1111 1111 1111 1111 1000 0000-补码
//打印无符号数：三码相等

//int main()
//{
//	char a = -128;
//	printf("%u\n",a);
//	return 0;
//}

int main()
{
	char a = 128;
	printf("%u\n", a);
	return 0;
}

//0000 0000 0000 0000 0000 0000 1000 0000
//0111 1111 1111 1111 1111 1111 0111 1111
//0111 1111 1111 1111 1111 1111 1000 0000
//整形提升后
//1111 1111 1111 1111 1111 1111 1000 0000
//1111 1111 1111 1111 1111 1111 1000 0000